# Building the Volcano Eruption Classification Model
### The model is to predict if a Volcano Eruption will occur in a place on a particular day.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# The preprocessing function accepts a pandas dataframe with the "Year", "Month" and "Day" features for when a natural disaster
# occured as well as the "Longitude" and "latitude" coordinates. The function returns a pandas dataframe with the mentioned 
# features but for all days within the starting and ending year of the original dataframe. It also has an added feature 
# "target" which is a 1 if a natural disaster occured on that day, and a 0 otherwise.

def preprocessing_dataframe(disaster_df):
    preprocessed_dict = {'Year': [], 'Latitude':[], 'Longitude': [], 'Month': [], 'Day': [], 'target': []} # Starting with a dictionary to hold all values, but will later change to a pandas dataframe
    # Creating a dictionary that stores the latitude and longitude values for each specific place in the dataframe
    print('Preprocessing ... ')
    print(' ')
    place_coords = {}
    for place in disaster_df['Name'].unique():
        lat = disaster_df[disaster_df['Name'] == place]['Latitude'].unique()[0]
        lng = disaster_df[disaster_df['Name'] == place]['Longitude'].unique()[0]
        place_coords[place] = (lat, lng)
        
    # All places with their respective coordinates are now stored in the "place_coords" dictionary
    
    year_start = disaster_df['Year'].unique().min() # Getting the earliest year in the dataframe
    year_end = disaster_df['Year'].unique().max() # Getting the last year in the dataframe
    
    # Now, I'll iterate through all the years in order to assign the targets
    for year in range(year_start, year_end+1):  
        year_df = disaster_df[disaster_df['Year'] == year] # Dataframe for disasters happening in year "year" 
        
        # I'll have to account for all the days of the months in the year, which are usually 30 and 31 except February
        # Assigning the number of days for a specific year in the month of February is dependent on if the year is a leap year 
        # or not, where the number of days will be 29 or 28 respectively.
        
        month_days = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31] # List containing number of days for each month of the year accordingly, i.e index 0 or January with 31 days. This is the list of days assuming it is not a leap year
        if year%4 == 0:
            if year%100 != 0:
                month_days[1] = 29
            else:
                if year%400 == 0:
                    month_days[1] = 29
        
        # Now, the "month_days" list's index "1" will remain 28 if it is not a leap year, and be changed to 29 if it is indeed
        # a leap year
        
        # Would also need to iterate through all the places in the dataframe
        for place in place_coords:
            place_df = year_df[year_df['Name'] == place] # DataFrame for observations of only the place "place" 
            month_number = 1 # This is supposed to be January
            
            #Similar, iterating through all months...
            for days in month_days:
                month_df = place_df[place_df['Month'] == month_number] # DataFrame containing observations of only the month "month"
                
                # Iterating through all the days in the month...
                for day in range(1, days+1):
                    preprocessed_dict['Year'].append(year)
                    preprocessed_dict['Latitude'].append(place_coords[place][0])
                    preprocessed_dict['Longitude'].append(place_coords[place][1])
                    preprocessed_dict['Month'].append(month_number)
                    preprocessed_dict['Day'].append(day)
                    # And finally, if the particular date is present in the dataframe, the target is set to 1, and 0 otherwise
                    if place in year_df['Name'].unique() and month_number in place_df['Month'].unique() and day in month_df['Day'].unique():
                        preprocessed_dict['target'].append(1)
                    else:
                        preprocessed_dict['target'].append(0)
                month_number += 1
                
    preprocessed_df = pd.DataFrame(preprocessed_dict) # Transforming to a dataframe
    
    # Things to note: The function doesn't consider nan values, so if there is a nan value in any of the date features it will
    # set the target to 0. Also, the preprocessed dataframe can be very large without care, so maybe sticking to 40, 50 years
    # at most will be desirable. Also helps that for latter years, there's a lot less nan values. But could also edit it to
    # perform a task if there is are nan values present.
    print('Done!')
    return preprocessed_df

In [3]:
volc = pd.read_csv('data/txt/volerup.txt',delimiter = '\t', quoting = 3, encoding='utf-8') # Volcano Eruption Dataset

In [4]:
volc.head()

,Year,Month,Day,TSU,EQ,Name,Location,Country,Latitude,Longitude,...,TOTAL_DEATHS,TOTAL_DEATHS_DESCRIPTION,TOTAL_MISSING,TOTAL_MISSING_DESCRIPTION,TOTAL_INJURIES,TOTAL_INJURIES_DESCRIPTION,TOTAL_DAMAGE_MILLIONS_DOLLARS,TOTAL_DAMAGE_DESCRIPTION,TOTAL_HOUSES_DESTROYED,TOTAL_HOUSES_DESTROYED_DESCRIPTION
0,-4360,NaN,NaN,NaN,NaN,Macauley Island,Kermadec Is,New Zealand,-30.200,-178.470,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,-4350,NaN,NaN,NaN,NaN,Kikai,Ryukyu Is,Japan,30.780,130.280,...,NaN,3.0,NaN,NaN,NaN,NaN,NaN,3.0,NaN,3.0
2,-4050,NaN,NaN,NaN,NaN,Masaya,Nicaragua,Nicaragua,11.984,-86.161,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,-4000,NaN,NaN,NaN,NaN,Pago,New Britain-SW Pac,Papua New Guinea,-5.580,150.520,...,NaN,1.0,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN
4,-3580,NaN,NaN,NaN,NaN,Taal,Luzon-Philippines,Philippines,14.002,120.993,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
volc  = volc[['Year','Month','Day','Name','Latitude','Longitude']] # Only relevant features

In [6]:
volc.head()

   Year  Month  Day             Name  Latitude  Longitude
0 -4360    NaN  NaN  Macauley Island   -30.200   -178.470
1 -4350    NaN  NaN            Kikai    30.780    130.280
2 -4050    NaN  NaN           Masaya    11.984    -86.161
3 -4000    NaN  NaN             Pago    -5.580    150.520
4 -3580    NaN  NaN             Taal    14.002    120.993

In [7]:
volc.shape

(835, 6)

In [23]:
# Unfortunately most of the day and month values for earlier years are missing so the model will only be trained on data from
# 1900. A drawback, but as seen the data from 1900 attributes to more than half of the dataset and has a lot less nan values. 

volc_1900 = volc[volc['Year'] >= 1900]
volc_1900.reset_index(drop=True, inplace=True)
volc_1900.shape

(472, 6)

In [24]:
volc_1900.head()

   Year  Month   Day        Name  Latitude  Longitude
0  1900    1.0  22.0       Asama    36.400    138.530
1  1900    2.0  16.0   Kirishima    31.930    130.870
2  1900    7.0  17.0     Adatara    37.620    140.280
3  1900    NaN   NaN  Tullu Moje     8.158     39.130
4  1901    5.0  22.0       Kelut    -7.930    112.308

In [25]:
volc_1900['Name'].value_counts()

Semeru               20
Merapi               20
Etna                 13
Asama                12
Kilauea              12
                     ..
Sarychev Peak         1
Grimsvotn             1
Niigata-Yake-yama     1
Hakkoda Group         1
Lamington             1
Name: Name, Length: 181, dtype: int64

In [29]:
count = 0
for p in volc_1900['Name'].value_counts():
    if p <= 2:
        count += 1
count

131

In [30]:
# The model could become biased if it's trained on data where some places have had not up to 2 disasters in the past 120 years. 
# So, these will be removed from the data to be trained.

p = volc_1900['Name'].value_counts()

for i in range(volc_1900.shape[0]):
    if  p[volc_1900.loc[i, 'Name']] <= 2: # Removed places with 2 or less occurences since 1900
        volc_1900.drop(i, axis=0, inplace=True)

C:\Users\User\anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [31]:
volc_1900.shape

(302, 6)

In [32]:
volc_1900['Name'].unique().shape

(50,)

In [33]:
(181-131)*365*220

4015000

In [34]:
volc_1900.dropna(inplace=True)
volc_1900.reset_index(drop=True, inplace=True)

C:\Users\User\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [35]:
volc_1900.head()

   Year  Month   Day       Name  Latitude  Longitude
0  1900    1.0  22.0      Asama     36.40    138.530
1  1900    2.0  16.0  Kirishima     31.93    130.870
2  1901    5.0  22.0      Kelut     -7.93    112.308
3  1902    5.0   5.0      Pelee     14.82    -61.170
4  1902    5.0   8.0      Pelee     14.82    -61.170

In [36]:
volc_1900.shape

(274, 6)

In [37]:
volc_1900.duplicated().any()

False

In [38]:
preprocessed_volc = preprocessing_dataframe(volc_1900) # Already done the preprocessing and saved the preprocessed dataframe

Preprocessing ...

Done!

In [39]:
preprocessed_volc.to_csv('preprocessed_volc.csv', index=False)

In [40]:
preprocessed_volc = pd.read_csv('preprocessed_volc.csv')

In [41]:
preprocessed_volc.head()

   Year  Latitude  Longitude  Month  Day  target
0  1900      36.4     138.53      1    1       0
1  1900      36.4     138.53      1    2       0
2  1900      36.4     138.53      1    3       0
3  1900      36.4     138.53      1    4       0
4  1900      36.4     138.53      1    5       0

In [42]:
preprocessed_volc.shape

(2209750, 6)

In [43]:
from sklearn.metrics import accuracy_score

In [49]:
# Taking out test data before upsampling
train_data = preprocessed_volc[preprocessed_volc['Year'] < 2019] # Training the model from 1980-2018
test_data = preprocessed_volc[preprocessed_volc['Year'] >= 2019]
test_data = test_data[test_data['Year'] < 2020] # Testing on 2019 only since there isn't enough data on 2020

In [50]:
train_data.head()

   Year  Latitude  Longitude  Month  Day  target
0  1900      36.4     138.53      1    1       0
1  1900      36.4     138.53      1    2       0
2  1900      36.4     138.53      1    3       0
3  1900      36.4     138.53      1    4       0
4  1900      36.4     138.53      1    5       0

In [51]:
train_data.shape

(2173200, 6)

In [54]:
len(train_data[train_data['target'] == 1])

268

In [55]:
num_zero_targets = len(train_data[train_data['target'] == 0])
num_zero_targets

2172932

In [56]:
majority = train_data[train_data['target'] == 0]
minority = train_data[train_data['target'] == 1]

In [57]:
majority.head()

   Year  Latitude  Longitude  Month  Day  target
0  1900      36.4     138.53      1    1       0
1  1900      36.4     138.53      1    2       0
2  1900      36.4     138.53      1    3       0
3  1900      36.4     138.53      1    4       0
4  1900      36.4     138.53      1    5       0

In [58]:
minority.head()

       Year  Latitude  Longitude  Month  Day  target
21     1900     36.40    138.530      1   22       1
411    1900     31.93    130.870      2   16       1
19121  1901     -7.93    112.308      5   22       1
37719  1902     14.82    -61.170      5    5       1
37722  1902     14.82    -61.170      5    8       1

In [59]:
from sklearn.utils import resample

In [60]:
# Basic upsampling minority class
min_upsamp = resample(minority, replace=True, n_samples=num_zero_targets, random_state=1)

In [61]:
min_upsamp.head()

         Year  Latitude  Longitude  Month  Day  target
552848   1930    38.789     15.213      9   11       1
2069167  2013    -7.542    110.442      2   12       1
962303   1952    32.100    139.850      9   16       1
2154322  2017     3.170     98.392      4   13       1
1852006  2001    37.734     15.004      7   26       1

In [62]:
min_upsamp.shape

(2172932, 6)

In [63]:
upsampled_data = pd.concat([majority, min_upsamp])

In [64]:
upsampled_data.shape

(4345864, 6)

In [65]:
upsampled_data = upsampled_data.sample(frac=1).reset_index(drop=True) # to shuffle the dataframe

In [66]:
upsampled_data.head()

   Year  Latitude  Longitude  Month  Day  target
0  1993     15.13     120.35      6   26       1
1  1945     12.77     124.05      9    4       0
2  1991     -1.52      29.25     12   25       0
3  1998     31.93     130.87      4   16       0
4  1917    -38.12     176.50      4    1       1

In [67]:
x_train = upsampled_data.iloc[:, 0:5]
y_train = upsampled_data.iloc[:, 5]

In [68]:
x_test = test_data.drop(columns='target')
y_test = test_data['target']

In [69]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
scaled_x_train = sc.fit_transform(x_train) # Scaling train_data
scaled_x_test =  sc.transform(x_test) # Scaling test_data

### Using Random Forest

In [ ]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier(n_estimators=30, criterion='entropy' , random_state=0)
classifier.fit(scaled_x_train, y_train)

In [ ]:
y_pred = classifier.predict(scaled_x_test)

In [ ]:
from sklearn.metrics import confusion_matrix, classification_report
cm = confusion_matrix(y_test, y_pred)

In [ ]:
cm

In [ ]:
print(accuracy_score(y_pred, y_test))

In [ ]:
y_pred.sum()

In [ ]:
y_test.sum()

In [ ]:
pred_dates = [] # List to store predicted dates a disaster will happen
for i in range(len(y_pred)):
    if y_pred[i] == 1:
        pred_dates.append(x_test.iloc[i])
pred_dates # Dates and places that the model predicted disasters will happen

In [ ]:
actual_dates = []
test_list = y_test.to_list()
for i in range(len(test_list)):
    if test_list[i] == 1:
        actual_dates.append(x_test.iloc[i])
actual_dates # Dates and places that disasters actually happened. Not much of a difference

In [ ]:
y_train.sum()

In [ ]:
# Predict class probabilities
y_pred_proba = classifier.predict_proba(x_test)
 
# Keep only the positive class
y_pred_proba = [y[1] for y in y_pred_proba]

In [ ]:
print(roc_auc_score(y_test, y_pred_proba)) #

In [ ]:
import gzip
import dill

In [ ]:
with gzip.open('volcano_classification_model.dill.gz', 'wb') as f:
    dill.dump(model, f, recurse=True)

In [ ]:
# Looks good, but knowing tree based algorithms it probably overfitted.

In [ ]:
#https://elitedatascience.com/imbalanced-classes